
define snegov = Character('Снегов', color="#003ea2")

define aperturova = Character('Апертурова', color="#f201ff")

define student = Character('Я', color="#00baaa")

label startChapter5:
    scene street with dissolve

    "Новый день, а впереди неизвестность."
    "Неизвестность заключается в новом предмете."
    "Вообще он называется “Нормирование качества и методы обращения с материалами информационных систем”"
    "Однако все зовут его Экологией."
    "Также разведданные говорят о том что у нас сразу два преподавателя на этом предмете."
    "Нечего думать. На паре всё станет ясно."


    scene ecolab2 with fade

    show aperturova:
        xpos 0.3
    with dissolve
    show snegov:
        xpos -0.3
    with dissolve

    snegov "Я пожалуй начну."

    snegov "Моё имя Сергей Спиридонович Снегов. Профессор. Химик."
    snegov "Вы здесь для того, чтобы изучить науку синтезирования различных веществ. Очень точную и тонкую науку."
    snegov "Глупое глядение в монитор к этой науке не имеет никакого отношения, и потому многие из вас с трудом поверят, что мой предмет является важной составляющей учебного плана."
    snegov "Я постараюсь научить вас, как околдовать разум и обмануть чувства. Я расскажу вам, как разлить по бутылкам спирт, как заваривать эпоксидную смолу и даже как закупорить аргон."
    "Часть про спирт явно заинтересовала студентов."

    aperturova "Вы уже закончили, Сергей Спиридонович?"
    aperturova "Прошу простить моего коллегу. Он совсем не понимает сути данной дисциплины."
    aperturova "Забудьте всё, что он вам сказал. Я начну сначала. Так, как правильно."
    aperturova "Добро пожаловать в компьютеризированный экспериментальный центр при лаборатории исследования природы."
    aperturova "Меня зовут Ирина Георгиевна Апертурова. Как наиболее квалифицированный специалист в этом помещении, я рекомендую не прибегать к помощи всяких зельеваров."
    snegov "Всякие, как вы выразились, зельевары, умеют преподавать дисциплину, в отличие от прочих инвалидов умственного труда."
    aperturova "Я пожалуй пропущу мимо ушей вашу грубость и продолжу выполнять свою работу."
    aperturova "В этом научном комплексе мы будем проводить различные эксперименты."
    aperturova "Экспериментальный центр гарантирует абсолютную безопасность условий каждого испытания."
    aperturova "А в опасных условиях экспериментальный центр предоставляет помощь в виде полезных советов"
    aperturova "В целях соблюдения безопасности проведения утвержденных программой опытов просим вас не уничтожать оборудование первостепенной важности."



    aperturova "Первое испытание: Тест на определение жёсткости воды."
    aperturova "Всё необходимое оборудование лежит перед вами."

    snegov "Ой, а вы, я вижу, совсем для умственно отсталых рассказываете."
    snegov "Студенты итак прекрасно видят приборы и, уверен, понимают что это за устройства."
    snegov "Лучше сразу переходит к рецепту успеха сегодняшнего предприятия."
    snegov "Рецепт следующий: в коническую колбу пипеткой поместить 50 кубических сантиметров воды, с помощью пипетки добавить 5 миллилитров буферного раствора. Далее следует добавить индикатор эриохрома черного Т.. Жидкость должна окраситься в сиреневый цвет."
    snegov "Самая интересная часть - это титрование. Нужно взять вторую пипетку и начать постепенно добавлять раствор трилона Б, пока цвет жидкости не сменится на синий потеряв красные тона. Спешить не следует, раствор меняет цвет только через несколько секунд. У некоторых особо торопливых жидкость не синеет, а чернеет. Количество капель нужно подсчитать и выяснить объём затраченного раствора трилона Б. Двадцать капель - один миллилитр."
    snegov "В итоге взяв эту цифру можно выяснить жёсткость воды."
    aperturova "Перед началом тестирования хотим вам напомнить, что хотя основным принципом экспериментального центра является обучение в игровой форме, мы не гарантируем отсутствие увечий и травм."
    aperturova "Можете приступать."
    


